[DromeDome_Fire X2CharacterTemplate]
strCharacterName="Andromedon Backburner"

[DromeDome_Poison X2CharacterTemplate]
strCharacterName="Andromedon Plaguebearer"

[DromeDome_Cryo X2CharacterTemplate]
strCharacterName="Andromedon Icepurger"

[DromeDome_Robot_Fire X2CharacterTemplate]
strCharacterName="Andromedon Backburner Shell"

[DromeDome_Robot_Poison X2CharacterTemplate]
strCharacterName="Andromedon Plaguebearer Shell"

[DromeDome_Robot_Cryo X2CharacterTemplate]
strCharacterName="Andromedon Icepurger Shell"

[DromeDome_Glob_Cryo X2AbilityTemplate]
LocFriendlyName="Launch Cryo Glob"
LocLongDescription="Freezes units and deals piercing damage to all units in the area of effect"
LocHelpText="Freezes units and deals piercing damage to all units in the area of effect"

[DromeDome_Glob_Cryo_WPN X2WeaponTemplate]
FriendlyName="Ice Glob Launcher"
BriefSummary="Ice Glob Launcher"
TacticalText="Ice Glob Launcher"

[DromeDome_Glob_Fire X2AbilityTemplate]
LocFriendlyName="Launch Fire Glob"
LocLongDescription="Deals damage and ignites targets in the area"
LocHelpText="Deals damage and ignites targets in the area"

[DromeDome_BackBurner X2AbilityTemplate]
LocFriendlyName="Flamethrower"
LocLongDescription="The Andromedon BackBurner shoots flame in a wide but short cone."
LocHelpText="The Andromedon BackBurner shoots flame in a wide but short cone."
LocFlyOverText="Flamethrower"

[DromeDome_BackBurner X2WeaponTemplate]
FriendlyName="Fireball Launcher"
BriefSummary="Fireball Launcher"
TacticalText="Fireball Launcher"

[DromeDome_Glob_Poison X2AbilityTemplate]
LocFriendlyName="Launch Poison Glob"
LocLongDescription="Deals damage and poisons targets in the area"
LocHelpText="Deals damage and poisons targets in the area"

[DromeDome_Glob_Poison X2WeaponTemplate]
FriendlyName="Poison Glob Launcher"
BriefSummary="Poison Glob Launcher"
TacticalText="Poison Glob Launcher"

[DromeDome_PlagueBearer_Stage1 X2AbilityTemplate]
LocFriendlyName="Plaguebearer"
LocLongDescription="The Andromedon Plaguebearer fires guided missiles into the sky. The targeting lasers that guide the missiles give a momentary warning of where they will strike."
LocHelpText="Delayed missile barrage that hits multiple enemies and spreads poison to targeted areas."
LocFlyOverText="Plaguebearer"

[DromeDome_WPN X2WeaponTemplate]
FriendlyName="Elemental Andromedon Cannon"
BriefSummary="Elemental Andromedon Cannon"
TacticalText="Elemental Andromedon Cannon"

[DromeDomeCryo_WPN X2WeaponTemplate]
FriendlyName="Elemental Andromedon Cannon"
BriefSummary="Elemental Andromedon Cannon"
TacticalText="Elemental Andromedon Cannon"

[DromeDome X2SitRepTemplate]
FriendlyName="The Drome Dome"
Description="A large group of heavily armored robotic Battlesuits have been seen in roaming the area, seemingly without any concrete goal."

[DromeDomeEffect X2SitRepEffect_ModifyDefaultEncounterLists]
FriendlyName="Welcome to The Drome Dome"
Description="/// Warning /// Containment breach /// Multiple unauthorized Battlesuits active ///"
